{
  "title": "Tim Hosler: Investment Banker and Unorthodox Thinker",
  "episode": "1",
  "guid": {
    "@isPermaLink": "false",
    "#text": "be241b7f-fc6e-4723-8358-ea90b4be6961"
  },
  "link": "https://share.transistor.fm/s/d4044750",
  "description": "Saint Louis Investment Banker Tim Hosler discusses unorthodox solutions to financial and political problems after Too Big to Fail and the latest election.",
  "content:encoded": "Tim Hosler is a Saint Louis investment banker, former CEO and a finance expert whose ideas are unorthodox and clever.  At times he has gone head to head with Warren Buffett, and is willing to offer ideas that will ruffle feathers.",
  "pubDate": "Tue, 07 May 2019 07:45:00 -0500",
  "author": "Vance Crowe",
  "enclosure": {
    "@url": "https://media.transistor.fm/d4044750/17b69436.mp3",
    "@length": "165347433",
    "@type": "audio/mpeg"
  },
  "image": {
    "@href": "https://images.transistor.fm/file/transistor/images/show/2051/full_1603741367-artwork.jpg"
  },
  "duration": "5090",
  "summary": "Saint Louis Investment Banker Tim Hosler discusses unorthodox solutions to financial and political problems after Too Big to Fail and the latest election.",
  "subtitle": "Saint Louis Investment Banker Tim Hosler discusses unorthodox solutions to financial and political problems after Too Big to Fail and the latest election.",
  "keywords": "Saint Louis, Finance, Too Big To Fail, politics, Venture Capital",
  "explicit": "No"
}

{
  "title": "Dr. Doug Sammons: What it takes to make a scientific discovery.",
  "itunes:episode": "2",
  "itunes:title": "Dr. Doug Sammons: What it takes to make a scientific discovery.",
  "itunes:episodeType": "full",
  "itunes:block": "No",
  "googleplay:block": "No",
  "guid": {
    "@isPermaLink": "false",
    "#text": "b2517467-32e4-409f-86b1-ac23204337b5"
  },
  "link": "https://share.transistor.fm/s/03afa3ba",
  "description": "Former Monsanto scientist Dr. Doug Sammons discusses the personality traits he didn't realize he had, what it takes to make a discovery and the sacrifices he wishes he would have made earlier in life. @WiltedWeeds",
  "content:encoded": "In this candid interview, world renowned biochemist Dr. Doug Sammons, formerly of Monsanto, discusses aspects of his personality that have been a blessing and a curse.  He highlights the difficulty of discovering something new, and how individuals can determine if a new scientific finding is real.  Dr. Sammons is on Twitter <a href=\"https://twitter.com/wiltedweeds\">@WiltedWeeds</a>",
  "pubDate": "Tue, 07 May 2019 07:45:00 -0500",
  "author": "Vance Crowe",
  "enclosure": {
    "@url": "https://media.transistor.fm/03afa3ba/3a8839bb.mp3",
    "@length": "175171615",
    "@type": "audio/mpeg"
  },
  "itunes:author": "Vance Crowe",
  "itunes:image": {
    "@href": "https://images.transistor.fm/file/transistor/images/show/2051/full_1603741367-artwork.jpg"
  },
  "itunes:duration": "5411",
  "itunes:summary": "Former Monsanto scientist Dr. Doug Sammons discusses the personality traits he didn't realize he had, what it takes to make a discovery and the sacrifices he wishes he would have made earlier in life. @WiltedWeeds",
  "itunes:subtitle": "Former Monsanto scientist Dr. Doug Sammons discusses the personality traits he didn't realize he had, what it takes to make a discovery and the sacrifices he wishes he would have made earlier in life. @WiltedWeeds",
  "itunes:keywords": "Science, Monsanto, Saint Louis, discovery, disagreeable, Ph.D.",
  "itunes:explicit": "No",
  "googleplay:explicit": "No"
},


&{Chris Williamson; Male model, night club promoter, philosopher, podcaster. Chris Williamson is a model and former reality TV start that spoke with Vance Crowe about being at the top of dominance hierarchies, how male models are different from female models, and why he takes cold showers as a way to wake himself up.  Williamson is candid in this interview talking about what it is like to be highly attractive, and having achieved popular success- fame on reality TV. Chris Williamson is a model and former reality TV start that spoke with Vance Crowe about being at the top of dominance hierarchies, how male models are different from female models, and why he takes cold showers as a way to wake himself up.  Williamson is candid in this interview talking about what it is like to be highly attractive, and having achieved popular success- fame on reality TV.  <br><br>Subscribe to the podcast for email notifications on new episodes, invites to events and other exclusive content — http://eepurl.com/gSTfk5<br>About the Vance Crowe Podcast — Vance Crowe interviews people with an expertise that you would want to know about, but might not think to ask. He prompts his guests to think about their work in novel ways, discusses how it applies to regular people and has fun sharing stories and experiences.<br>Want to support the podcast?  <a href="https://ratethispodcast.com/vcp">https://ratethispodcast.com/vcp</a><br>Join the Articulate Ventures Network | <a href="https://network.articulate.ventures/">https://network.articulate.ventures/</a> —We are a patchwork of thinkers that want to articulate ideas in a forum where they can be respectfully challenged, improved and celebrated so that we can explore complex subjects, learn from those we disagree with and achieve our personal &amp; professional goals.<br>Contact Vance for a Talk | <a href="https://www.vancecrowe.com/">https://www.vancecrowe.com/</a> —Vance delivers speeches that reveal important aspects of human communication.  Audiences are entertained, engaged, and leave feeling empowered to change something about the way they are communicating.  Vance tells stories about his own experiences, discusses theories in ways that make them relatable and highlights interesting people, books, and media that the audience can learn even more from. <br>Join the #ATCF Book Club | <a href="https://articulate.ventures/category/atcf-book-club">https://articulate.ventures/category/atcf-book-club</a><br><br> https://share.transistor.fm/s/37704397  <nil> Tue, 26 Jan 2021 04:20:00 -0600 2021-01-26 10:20:00 +0000 UTC 0xc000217000 868b48dd-6ae5-4231-a0fd-9c65a42096d6 0xc000217020 [Experts  Saint Louis  St. Louis  Vance Crowe  discipline  psychology  economics  biology  biotech  science ] [0xc0001f3260] <nil> 0xc0001ac410 map[googleplay:map[block:[{block No map[] map[]}] explicit:[{explicit No map[] map[]}]] itunes:map[author:[{author Vance Crowe map[] map[]}] block:[{block No map[] map[]}] duration:[{duration 4304 map[] map[]}] episode:[{episode 109 map[] map[]}] episodeType:[{episodeType full map[] map[]}] explicit:[{explicit No map[] map[]}] image:[{image  map[href:https://images.transistor.fm/file/transistor/images/show/2051/full_1603741367-artwork.jpg] map[]}] keywords:[{keywords Experts, Saint Louis, St. Louis, Vance Crowe, discipline, psychology, economics, biology, biotech, science, map[] map[]}] subtitle:[{subtitle Chris Williamson is a model and former reality TV start that spoke with Vance Crowe about being at the top of dominance hierarchies, how male models are different from female models, and why he takes cold showers as a way to wake himself up.  Williamson i map[] map[]}] summary:[{summary Chris Williamson is a model and former reality TV start that spoke with Vance Crowe about being at the top of dominance hierarchies, how male models are different from female models, and why he takes cold showers as a way to wake himself up.  Williamson is candid in this interview talking about what it is like to be highly attractive, and having achieved popular success- fame on reality TV. map[] map[]}] title:[{title Chris Williamson; Male model, night club promoter, philosopher, podcaster. map[] map[]}]]] map[]}